tap "cormacrelf/tap"
tap "crisidev/chunkwm"
tap "daipeihust/tap"
tap "dandavison/open-in-editor", "https://github.com/dandavison/open-in-editor.git"
tap "eth-p/software"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "morantron/tmux-fingers"
tap "ms-jpq/sad"
tap "noahgorstein/tap"
tap "schniz/tap"
tap "sourcegraph/src-cli"
brew "abduco"
brew "libtiff"
brew "openexr"
brew "webp"
brew "aom"
brew "ast-grep"
brew "atool"
brew "bash"
brew "ca-certificates"
brew "openssl@3"
brew "bat"
brew "bdw-gc"
brew "boost"
brew "freetype"
brew "pcre2"
brew "sqlite"
brew "glib", link: false
brew "libxcb"
brew "libx11"
brew "chezmoi"
brew "clang-format"
brew "nettle"
brew "gnutls"
brew "python@3.9"
brew "libssh"
brew "qemu"
brew "lima"
brew "colima"
brew "coreutils"
brew "diff-so-fancy"
brew "docker"
brew "double-conversion"
brew "fmt"
brew "wangle"
brew "fb303"
brew "entr"
brew "exa"
brew "exiftool"
brew "fasd"
brew "fd"
brew "figlet"
brew "file-formula"
brew "findutils"
brew "fnm"
brew "fribidi"
brew "fzf"
brew "gawk"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "git-delta"
brew "glow"
brew "gnu-sed"
brew "gnu-typist"
brew "gobject-introspection"
brew "jasper"
brew "netpbm"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "htop"
brew "httpie"
brew "httrack"
brew "imlib2"
brew "jemalloc"
brew "jless"
brew "jq"
brew "lazygit"
brew "libcaca"
brew "libexif"
brew "libvterm"
brew "libzip"
brew "luajit"
brew "luarocks"
brew "luv"
brew "tree-sitter"
brew "neovim"
brew "nghttp2"
brew "node", link: false
brew "nvm"
brew "pandoc"
brew "prettier"
brew "protobuf"
brew "pyenv"
brew "python@3.11"
brew "python@3.7"
brew "python@3.8"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby"
brew "shfmt"
brew "six"
brew "slides"
brew "starship"
brew "task"
brew "taskwarrior-tui"
brew "telnet"
brew "tldr"
brew "tmux"
brew "tmuxp"
brew "w3m"
brew "watchman"
brew "wget"
brew "xclip"
brew "yadm"
brew "zk"
brew "zoxide"
brew "cormacrelf/tap/dark-notify"
brew "daipeihust/tap/im-select"
brew "eth-p/software/bat-extras"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "morantron/tmux-fingers/tmux-fingers"
brew "ms-jpq/sad/sad"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "kdiff3"
cask "keepassxc"
cask "open-in-editor"
cask "qutebrowser"
cask "rectangle"
cask "vimr"
cask "wezterm"
cask "xquartz"
